Notebook.org
#+TITLE: QuarkSuite Core (v2.0.0)
#+PROPERTY: header-args:shell :results output code

* Table of Contents :TOC@5:
- [[#summary][Summary]]
- [[#whats-new-in-v2][What's New in v2?]]
  - [[#workflows][Workflows]]
    - [[#core][Core]]
    - [[#dsl][DSL]]
  - [[#settled-types][Settled Types]]
  - [[#improved-performance][Improved Performance]]
  - [[#internal-simplicity][Internal Simplicity]]
  - [[#improved-modularity][Improved Modularity]]
- [[#spec][Spec]]
  - [[#api][API]]
    - [[#functional-utilities][Functional Utilities]]
      - [[#process][process]]
        - [[#process-examples][process Examples]]
        - [[#process-implementation][process Implementation]]
        - [[#process-tests][process Tests]]
      - [[#preset][preset]]
        - [[#preset-examples][preset Examples]]
        - [[#preset-implementation][preset Implementation]]
        - [[#preset-tests][preset Tests]]
      - [[#pipeline][pipeline]]
        - [[#pipeline-examples][pipeline Examples]]
        - [[#pipeline-implementation][pipeline Implementation]]
        - [[#pipeline-tests][pipeline Tests]]
      - [[#propagate][propagate]]
        - [[#propagate-examples][propagate Examples]]
        - [[#propagate-implementation][propagate Implementation]]
        - [[#propagate-tests][propagate Tests]]
      - [[#delegate][delegate]]
        - [[#delegate-examples][delegate Examples]]
        - [[#delegate-implementation][delegate Implementation]]
        - [[#delegate-tests][delegate Tests]]
    - [[#color][Color]]
      - [[#convert][convert]]
        - [[#convert-examples][convert Examples]]
        - [[#convert-implementation][convert Implementation]]
        - [[#convert-tests][convert Tests]]
      - [[#adjust][adjust]]
        - [[#adjust-examples][adjust Examples]]
        - [[#adjust-implementation][adjust Implementation]]
        - [[#adjust-tests][adjust Tests]]
      - [[#mix][mix]]
        - [[#mix-examples][mix Examples]]
        - [[#mix-implementation][mix Implementation]]
        - [[#mix-tests][mix Tests]]
      - [[#harmony][harmony]]
        - [[#harmony-examples][harmony Examples]]
        - [[#harmony-implementation][harmony Implementation]]
        - [[#harmony-tests][harmony Tests]]
      - [[#vision][vision]]
        - [[#vision-examples][vision Examples]]
        - [[#vision-implementation][vision Implementation]]
        - [[#vision-tests][vision Tests]]
      - [[#contrast][contrast]]
        - [[#contrast-examples][contrast Examples]]
        - [[#contrast-implementation][contrast Implementation]]
        - [[#contrast-tests][contrast Tests]]
      - [[#illuminant][illuminant]]
        - [[#illuminant-examples][illuminant Examples]]
        - [[#illuminant-implementation][illuminant Implementation]]
        - [[#illuminant-tests][illuminant Tests]]
      - [[#palette][palette]]
        - [[#palette-examples][palette Examples]]
        - [[#palette-implementation][palette Implementation]]
        - [[#palette-tests][palette Tests]]
      - [[#accessibility][accessibility]]
        - [[#accessibility-examples][accessibility Examples]]
        - [[#accessibility-implementation][accessibility Implementation]]
        - [[#accessibility-tests][accessibility Tests]]
      - [[#tokens][tokens]]
        - [[#tokens-examples][tokens Examples]]
        - [[#tokens-color-implementation][tokens (Color) Implementation]]
        - [[#tokens-color-tests][tokens (Color) Tests]]
    - [[#content][Content]]
      - [[#text][text]]
        - [[#text-examples][text Examples]]
        - [[#text-implementation][text Implementation]]
        - [[#text-tests][text Tests]]
      - [[#ms][ms]]
        - [[#ms-examples][ms Examples]]
        - [[#ms-implementation][ms Implementation]]
        - [[#ms-tests][ms Tests]]
      - [[#modify][modify]]
        - [[#modify-examples][modify Examples]]
        - [[#modify-implementation][modify Implementation]]
        - [[#modify-tests][modify Tests]]
      - [[#tokens-1][tokens]]
        - [[#tokens-examples-1][tokens Examples]]
        - [[#tokens-content-implementation][tokens (Content) Implementation]]
        - [[#tokens-content-tests][tokens (Content) Tests]]
  - [[#internals][Internals]]
    - [[#functional][Functional]]
      - [[#composition-internals][Composition Internals]]
    - [[#color-1][Color]]
      - [[#conversion][Conversion]]
        - [[#tokenization][Tokenization]]
        - [[#validation][Validation]]
        - [[#extraction][Extraction]]
        - [[#parsing][Parsing]]
        - [[#calculation][Calculation]]
        - [[#serialization][Serialization]]
      - [[#color-adjustment][Color Adjustment]]
        - [[#target-properties][Target Properties]]
        - [[#perceptually-uniform-color-adjustment][Perceptually Uniform Color Adjustment]]
        - [[#color-adjustment-through-oklch][Color Adjustment Through OKLCH]]
      - [[#color-mixture][Color Mixture]]
        - [[#perceptually-uniform-color-mixture][Perceptually Uniform Color Mixture]]
        - [[#color-mixture-through-oklab][Color Mixture Through OKLab]]
      - [[#color-perception][Color Perception]]
        - [[#color-vision-deficiency-colorblindness][Color Vision Deficiency (Colorblindness)]]
        - [[#contrast-sensitivity][Contrast Sensitivity]]
        - [[#correlated-color-temperature-cct][Correlated Color Temperature (CCT)]]
      - [[#color-interpolation][Color Interpolation]]
      - [[#color-harmonies][Color Harmonies]]
      - [[#palette-configurations][Palette Configurations]]
        - [[#material-configuration][Material Configuration]]
        - [[#artistic-configuration][Artistic Configuration]]
      - [[#palette-accessibility][Palette Accessibility]]
        - [[#wcag-color-contrast-ratios][WCAG Color Contrast Ratios]]
        - [[#colorimetric-contrast][Colorimetric Contrast]]
      - [[#palette-formatting][Palette Formatting]]
    - [[#content-1][Content]]
      - [[#modular-scales][Modular Scales]]
        - [[#creating-a-raw-modular-scale][Creating a Raw Modular Scale]]
        - [[#scale-modification][Scale Modification]]
        - [[#scale-configurations][Scale Configurations]]
        - [[#scale-units][Scale Units]]
      - [[#text-families][Text Families]]
      - [[#token-assembly][Token Assembly]]

* Summary

This document is my scratchpad/workspace as I further refine QuarkSuite. Literate programming gives me a clear space to
think, iterate, and speculate on different approaches to my ultimate goal of a more enjoyable, flexible, and powerful
design token development environment for web projects. It also allows me to automate my directory structure.

For incremental improvements and function documentation, I work directly with the source code. This document will not
stay current after everything is locked in.

* What's New in v2?

** Workflows

*** Core

v2 focuses *exclusively* on the relationship between types, their available actions, and output emitters. This means the
workflow has been refined and tightened for even greater functional flexibility and the object factory pattern is retired.

The API now follows a simple, explicit architecture:

+ =action(y, x)=: indicates that a function performs an action on type =x= with =y= modifying the output
+ =emitter(x)=: indicates that a function emits output /directly from/ =x=

The functional helpers provided are a small subset optimized for the values and collections generated by QuarkSuite. You
should absolutely not use them for general data handling.

*** DSL

QuarkSuite v2 provides a brand new DSL (domain specific language) around vanilla web components.

Rather than using them solely to /render/ data generated by the core library, they will instead /translate/ the
functions of the core as a declarative workflow embedded in your markup.

The reason why the DSL is built around web components is for the semantic benefits and the undeniable portability of
using HTML as the *entire workspace* of your design token development environment.

It means you can work with a technology that you or everyone on your team probably knows or uses. And because the DSL is
realized through your markup, it *doesn't change unless you change it*.

The available elements will match equivalent actions and emitters in the core. For example: the =vision= action of the =color=
module becomes the =<color-vision>= element used declaratively. Some

The other difference from the core workflow is that an =<x-define>= element is provided for each =x= type which translates
the initial value assignment. So =<color-define>= allows you to create an initial color declaratively.

As the DSL is derived from functions in the core, you can use their output interchangeably to translate or transmit as
needed. You'll end up with the same results regardless.

The DSL is a work in progress and being created in conjunction with Core v2. You can [[https://github.com/quarksuite/dsl][check out its repo]] if you want.

** Settled Types

+ =fn=: functional helpers
+ =color=: individual colors (of any valid CSS format)
+ =palette=: generated color palettes
+ =ms=: raw modular scales
+ =tokens=: token collections

** Improved Performance

The library is already pretty fast, but it could be faster. That in itself is enough for me to research ways to squeeze
a little more performance out of everything happening under the hood.

** Internal Simplicity

Up until now, QuarkSuite used some internal patterns and structure that at the time was some pretty clever code. At the
same time, this makes it a bit /too clever to debug effectively/. I'm being more judicious toward complexity and
limiting it to where it's needed.

** Improved Modularity

Where v1 kept its code in a single =mod.js= file, v2 splits the functionality into discrete modules associated with the
available types. This will make it easier to develop and debug while allowing more types to be added in the future.

In addition, the internal library has been expanded so that each utility exposed in the API is truly uncoupled from the
rest. This means that modern build tools, and environments that support tree shaking, will only pull in what's needed.

* Spec

The library begins with an entry point =mod.js= that aggregates all the functionality to make it easier to experiment
during development before you've settled on what you need. QuarkSuite v2 separates all functionality by its input type.

#+BEGIN_SRC js :tangle "./v2/mod.js" :comments link
export * as fn from "./fn.js";
export * as color from "./color.js";
export * as content from "./content.js";
#+END_SRC

** API

*** Functional Utilities
:PROPERTIES:
:header-args:js: :tangle "./v2/fn.js" :mkdirp yes :comments link
:END:

**** process

A functional utility that combines emitters into a process.

+ =process(...emitters) => (x)=
  - =emitters: Array<(x)>=: sequence of emitters to combine

***** process Examples

***** process Implementation

#+BEGIN_SRC js
export function process(...emitters) {
  return compose(...emitters);
}
#+END_SRC

***** process Tests

**** preset

A functional utility that accepts an action and its modifiers and converts it to an emitter.

+ =preset(action, y) => (x)=
  - =action: (y, x) => unknown=: the action to transform
  - =y: unknown=: the action's associated modifiers

***** preset Examples

***** preset Implementation

#+BEGIN_SRC js
export function preset(action, y) {
  return (x) => action(y, x);
}
#+END_SRC

***** preset Tests

**** pipeline

A functional utility that shuttles data =x= through a process pipeline.

+ =pipeline(x, ...processes) => unknown=
  + =x: unknown=: data to pipe
  + =processes: Array<(x)>=: sequence of processes to transform data

***** pipeline Examples

***** pipeline Implementation

#+BEGIN_SRC js
export function pipeline(x, ...processes) {
  return compose(...processes)(x);
}
#+END_SRC

***** pipeline Tests

**** propagate

A functional utility that allows an =emitter= to propagate over a collection of =xs=.

+ =propagate(emitter, xs) => unknown=
  - =emitter: (x) => unknown=: the emitter to use
  - =xs: unknown[]=: the data collection to map over

***** propagate Examples

***** propagate Implementation

#+BEGIN_SRC js
export function propagate(emitter, xs) {
  return xs.map((x) => emitter(x));
}
#+END_SRC

***** propagate Tests

**** delegate

A functional utility that maps a collection of =emitters= to a collection of =xs= inputs.

As a rule, only delegations that match to an input will return output. This means you can /assign/ your delegations
directly to the inputs in =xs= you actually want to transform. Any unmatched inputs will simply be left out.

+ =delegate(emitters, xs) => unknown[]=
  - =emitters: Array<(x)>=: the collection of emitters to assign
  - =xs: unknown[]=: the data collection of delegation targets

***** delegate Examples

***** delegate Implementation

#+BEGIN_SRC js
export function delegate(emitters, xs) {
  return emitters
    .map((f, pos) => (xs[pos] ? f(xs[pos]) : undefined))
    .filter((result) => result !== undefined);
}
#+END_SRC

***** delegate Tests

*** Color
:PROPERTIES:
:header-args:js: :tangle "./v2/color.js" :mkdirp yes :comments link
:END:

**** convert

An action that converts a given valid CSS =color= =to= another valid CSS color
format.

+ =convert(to, color) => string=
  - =to: string | "hex" | "rgb" | "hsl" | "cmyk" | "hwb" | "cielab" | "cielch" | "oklab" | "oklch"=: the target color
    format
  - =color: string=: the color to convert

***** convert Examples

***** convert Implementation

#+BEGIN_SRC js
export function convert(to, color) {
  if (to === "lab") {
    return serialize(_convert(color, "cielab"));
  }

  if (to === "lch") {
    return serialize(_convert(color, "cielch"));
  }

  return serialize(_convert(color, to));
}
#+END_SRC

