Notebook.org
**** contrast

A perception checking color action that simulates the influence of contrast sensitivity on a =color=.

You can set a contrast =factor= as a percentage (with ~0~ translating to pure black, ~50~ to pure gray, and ~100~ to
pure white) as well as the =severity=.

If =steps= is >0 this activates an interpolated simulation sequence. This is useful for observing multiple simulation
conditions at once.

+ =contrast(settings, color)=
  - =settings: {}=: contrast sensitivity settings
    * =settings.factor = 0: number=: set the contrast factor to simulate (as a percentage from black to gray to white)
    * =settings.severity = 50: number=: set the severity of the contrast loss
    * =settings.steps = 0: number=: activates interpolated simulation when >0
  - =color: string=: the color to influence

***** contrast Examples

***** contrast Implementation

#+BEGIN_SRC js
export function contrast(settings, color) {
  // Set defaults
  const { factor = 0, severity = 50, steps = 0 } = settings;

  if (steps) {
    return colorInterpolation(
      checkSensitivity,
      {
        contrast: factor,
        strength: severity,
        steps,
      },
      color,
    );
  }

  return checkSensitivity(
    { contrast: factor, strength: severity, steps },
    color,
  );
}
#+END_SRC

***** contrast Tests

#+BEGIN_SRC js :tangle "./v2/tests/color/contrast_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { contrast } from "../../color.js";

describe("contrast(settings, color)", () => {
  it("should reject invalid colors", () => {
    expect(() => contrast({}, "invalid")).toThrow();
  });

  const [red, green, blue, purple] = [
    "crimson",
    "chartreuse",
    "dodgerblue",
    "rebeccapurple",
  ];

  const contrastSamples = {
    0: {
      red: [red, ["#dc143c", "#950a26", "#540311", "#1b0002", "#000000"]],
      green: [green, ["#7fff00", "#54ae00", "#2d6300", "#0b2200", "#000000"]],
      blue: [blue, ["#1e90ff", "#1160ae", "#053463", "#010e22", "#000000"]],
    },
    25: {
      red: [red, ["#dc143c", "#ab2837", "#7c2c31", "#4f2a2a", "#222222"]],
      green: [green, ["#7fff00", "#68c22c", "#518933", "#3a532e", "#222222"]],
      blue: [blue, ["#1e90ff", "#2973c2", "#2c5789", "#293c53", "#222222"]],
    },
    50: {
      red: [red, ["#dc143c", "#c03e48", "#a45052", "#855c5b", "#636363"]],
      green: [green, ["#7fff00", "#7cd746", "#76af59", "#6e8961", "#636363"]],
      blue: [blue, ["#1e90ff", "#3e86d7", "#4f7cb0", "#5b7089", "#636363"]],
    },
    75: {
      red: [red, ["#dc143c", "#d6525a", "#ce7576", "#c19392", "#aeaeae"]],
      green: [green, ["#7fff00", "#90ec5d", "#9dd880", "#a6c399", "#aeaeae"]],
      blue: [blue, ["#1e90ff", "#529aec", "#74a2d9", "#92a9c4", "#aeaeae"]],
    },
    100: {
      red: [red, ["#dc143c", "#ec666c", "#f89c9b", "#ffcecc", "#ffffff"]],
      green: [green, ["#7fff00", "#a4ff72", "#c4ffa7", "#e2ffd5", "#ffffff"]],
      blue: [blue, ["#1e90ff", "#65aeff", "#9acaff", "#cde5ff", "#ffffff"]],
    },
  };

  it("should correctly simulate contrast sensitivity on sample data set", () => {
    Object.entries(contrastSamples).forEach(([factor, data]) => {
      Object.values(data).forEach(([input, results]) => {
        results.forEach((output, pos) => {
          expect(contrast({ factor, severity: 25 * pos }, input)).toBe(output);
        });
      });
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color/contrast_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  contrast(settings, color)
  • should reject invalid colors
  • should correctly simulate contrast sensitivity on sample data set

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color/contrast_test.js
test contrast(settings, color) > should reject invalid colors ... ok (37ms)
test contrast(settings, color) > should correctly simulate contrast sensitivity on sample data set ... ok (311ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (415ms)

#+end_src

**** illuminant

A perception checking color action that simulates the influence of an illuminant (or light source) on a =color=.

You can set the temperature (=K=) of your target light source as well as the =intensity= of its effect.

If =steps= is >0 this activates an interpolated simulation sequence. This is useful for observing multiple simulation
conditions at once.

+ =illuminant(settings, color)=
  - =settings: {}= illuminant settings
    * =settings.K = 1850: number=: the temperature of the light source in kelvin (candlelight at ~1850~ by default)
    * =settings.intensity = 50: number=: the intensity of the light source
    * =settings.steps = 0: number=: activates interpolated simulation when >0
  - =color: string=: the color to influence

***** illuminant Examples

***** illuminant Implementation

#+BEGIN_SRC js
export function illuminant(settings, color) {
  // Set defaults
  const { K = 1850, intensity = 50, steps = 0 } = settings;

  const { temperature = 1000 } = settings;

  if (steps) {
    return colorInterpolation(
      checkIlluminant,
      {
        temperature: K,
        strength: intensity,
        steps,
      },
      color,
    );
  }

  return checkIlluminant({ temperature: K, strength: intensity, steps }, color);
}
#+END_SRC

***** illuminant Tests

#+BEGIN_SRC js :tangle "./v2/tests/color/illuminant_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { illuminant } from "../../color.js";

describe("illuminant(settings, color)", () => {
  it("should reject invalid colors", () => {
    expect(() => illuminant({}, "invalid")).toThrow();
  });

  const [red, green, blue, purple] = [
    "crimson",
    "chartreuse",
    "dodgerblue",
    "rebeccapurple",
  ];

  const illuminantSamples = {
    1000: {
      red: [red, ["#dc143c", "#e52435", "#ed302c", "#f63a1e", "#ff4400"]],
      green: [green, ["#7fff00", "#bbd900", "#dcb000", "#f18200", "#ff4400"]],
      blue: [blue, ["#1e90ff", "#7c8cd0", "#af809f", "#d96b69", "#ff4400"]],
    },
    2400: {
      red: [red, ["#dc143c", "#e6463e", "#ef653e", "#f8813e", "#ff9b3d"]],
      green: [green, ["#7fff00", "#b1e820", "#d2d02e", "#ebb737", "#ff9b3d"]],
      blue: [blue, ["#1e90ff", "#719bda", "#a5a0b1", "#d3a083", "#ff9b3d"]],
    },
    4800: {
      red: [red, ["#dc143c", "#ea5d5e", "#f58b80", "#fcb6a3", "#ffe0c7"]],
      green: [green, ["#7fff00", "#a8f95f", "#c8f288", "#e5eaa9", "#ffe0c7"]],
      blue: [blue, ["#1e90ff", "#68a8f5", "#9dbce9", "#cfcfda", "#ffe0c7"]],
    },
    6400: {
      red: [red, ["#dc143c", "#ec656a", "#f89b98", "#feccc7", "#fffdf8"]],
      green: [green, ["#7fff00", "#a4ff70", "#c5ffa3", "#e3ffcf", "#fffdf8"]],
      blue: [blue, ["#1e90ff", "#65aeff", "#9ac9ff", "#cde4fd", "#fffdf8"]],
    },
    12800: {
      red: [red, ["#dc143c", "#dd5d6e", "#d9889e", "#ceaece", "#bcd2ff"]],
      green: [green, ["#7fff00", "#90f679", "#9fecad", "#aee0d8", "#bcd2ff"]],
      blue: [blue, ["#1e90ff", "#53a2ff", "#79b2ff", "#9bc3ff", "#bcd2ff"]],
    },
  };

  it("should correctly simulate the effects of various light sources on sample data", () => {
    Object.entries(illuminantSamples).forEach(([K, data]) => {
      Object.values(data).forEach(([input, results]) => {
        results.forEach((output, pos) => {
          expect(illuminant({ K, intensity: 25 * pos }, input)).toBe(output);
        });
      });
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color/illuminant_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  illuminant(settings, color)
  • should reject invalid colors
  • should correctly simulate the effects of various light sources on sample data

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color/illuminant_test.js
test illuminant(settings, color) > should reject invalid colors ... ok (24ms)
test illuminant(settings, color) > should correctly simulate the effects of various light sources on sample data ... ok (162ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (252ms)

#+end_src

**** palette

An action that accepts a =color= and creates a palette based on the given =configuration=.

The defined configurations are =material= and =artistic=. They have their own settings.

+ =palette(settings, color) => string[][]=
  - =settings: {}=: palette creation settings
    * =settings.configuration = "material": "material" | "artistic"=: the palette configuration configuration (exposes different settings)
    * =settings.accented = false: boolean=: include accented variants? (active with =material=)
    * =settings.tints = 3: number=: total number of tints to generate (active with =artistic=)
    * =settings.tones = 3: number=: total number of tones to generate (active with =artistic=)
    * =settings.shades = 3: number=: total number of shades to generate (active with =artistic=)
    * =settings.contrast = 100: number=: overall palette contrast (active with both configurations)
    * =settings.stated = false: boolean=: include interface states? (active with both configurations)
  - =color: string=: any valid CSS color

***** palette Examples

***** palette Implementation

#+BEGIN_SRC js
export function palette(settings, color) {
  // Set default configuration and settings and exclude interface states until requested
  const {
    configuration = "material",
    contrast = 100,
    accented = false,
    stated = false,
  } = settings;

  // Generate from material-esque or artistic configuration depending on configuration
  if (configuration === "artistic") {
    const { tints = 3, tones = 3, shades = 3 } = settings;

    return artisticConfiguration(
      { contrast, tints, tones, shades, stated },
      color,
    );
  }

  return materialConfiguration({ contrast, accented, stated }, color);
}
#+END_SRC

