Notebook.org
***** accessibility Tests

#+BEGIN_SRC js :tangle "./v2/tests/color/accessibility_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { accessibility, palette } from "../../color.js";

describe("accessibility(settings, palette)", () => {
  it("should reject invalid colors", () => {
    expect(() => accessibility({}, palette({}, "invalid"))).toThrow();
  });

  const [red, green, blue] = ["crimson", "chartreuse", "dodgerblue"];

  describe("settings.mode = 'standard'", () => {
    it("should work with default settings", () => {
      expect(accessibility({}, palette({}, red))).toEqual([
        ["#ffffff", "#111111"],
        [["#aa2033", "#7a2229", "#4d1e20", "#231616"], []],
        [],
      ]);
      expect(
        accessibility({}, palette({ configuration: "artistic" }, green)),
      ).toEqual([["#ffffff", "#111111"], [[], [], ["#3c6625", "#1c2418"]], []]);
      expect(accessibility({}, palette({}, blue))).toEqual([
        ["#ffffff", "#111111"],
        [["#2371c3", "#22538a", "#1d3755", "#161c25"], []],
        [],
      ]);
    });

    it("should activate settings.rating", () => {
      expect(
        accessibility(
          { rating: "AAA" },
          palette(
            { configuration: "artistic", tints: 15, tones: 8, shades: 15 },
            red,
          ),
        ),
      ).toEqual([
        ["#ffffff", "#111111"],
        [
          [],
          [],
          [
            "#a72032",
            "#9a2130",
            "#8d222d",
            "#81222b",
            "#742128",
            "#682125",
            "#5c2023",
            "#501e20",
            "#451d1e",
            "#391b1b",
            "#2e1818",
            "#231616",
          ],
        ],
        [],
      ]);
      expect(accessibility({ rating: "AA" }, palette({}, green))).toEqual([
        ["#ffffff", "#111111"],
        [["#345422", "#1c2418"], []],
        [],
      ]);
      expect(
        accessibility(
          { rating: "AAA" },
          palette(
            { configuration: "artistic", tints: 16, tones: 8, shades: 8 },
            blue,
          ),
        ),
      ).toEqual([
        ["#ffffff", "#111111"],
        [[], [], ["#22538a", "#20456f", "#1d3755", "#1a2a3c", "#161c25"]],
        [],
      ]);
    });
    it("should activate settings.large", () => {
      expect(
        accessibility({ large: true }, palette({ contrast: 90 }, red)),
      ).toEqual([
        ["#ffebeb", "#231616"],
        [["#e54956", "#af1f34", "#84222b", "#5b1f23", "#34191a"], []],
        [],
      ]);
      expect(
        accessibility(
          { large: true },
          palette({ configuration: "artistic", contrast: 85 }, green),
        ),
      ).toEqual([["#eeffe6", "#212f1a"], [[], [], ["#467b26", "#2a411f"]], []]);
      expect(
        accessibility({ large: true }, palette({ contrast: 80 }, blue)),
      ).toEqual([
        ["#d7eaff", "#192839"],
        [["#2277cf", "#235fa0", "#214874", "#1c324b"], []],
        [],
      ]);
    });
  });
  describe("settings.mode = 'custom'", () => {
    it("should activate settings.min", () => {
      expect(
        accessibility({ mode: "custom", min: 50 }, palette({}, red)),
      ).toEqual([
        ["#ffffff", "#111111"],
        [["#aa2033", "#7a2229", "#4d1e20", "#231616"], []],
        [],
      ]);
      expect(
        accessibility(
          { mode: "custom", min: 64 },
          palette({ configuration: "artistic" }, green),
        ),
      ).toEqual([["#ffffff", "#111111"], [[], [], ["#1c2418"]], []]);
      expect(
        accessibility({ mode: "custom", min: 80 }, palette({}, blue)),
      ).toEqual([["#ffffff", "#111111"], [[], []], []]);
    });
    it("should activate settings.max", () => {
      expect(
        accessibility({ mode: "custom", min: 50, max: 70 }, palette({}, red)),
      ).toEqual([
        ["#ffffff", "#111111"],
        [["#aa2033", "#7a2229", "#4d1e20"], []],
        [],
      ]);
      expect(
        accessibility(
          { mode: "custom", min: 50, max: 75 },
          palette({ configuration: "artistic" }, green),
        ),
      ).toEqual([["#ffffff", "#111111"], [[], [], ["#3c6625"]], []]);
      expect(
        accessibility({ mode: "custom", min: 50, max: 80 }, palette({}, blue)),
      ).toEqual([
        ["#ffffff", "#111111"],
        [["#22538a", "#1d3755", "#161c25"], []],
        [],
      ]);
    });
  });
  it("settings.dark active for both modes", () => {
    expect(accessibility({ dark: true }, palette({}, red))).toEqual([
      ["#111111", "#ffffff"],
      [["#ffebeb", "#ffcecc", "#fbb0af", "#f69292", "#ef7175", "#e64d59"], []],
      [],
    ]);
    expect(
      accessibility(
        { mode: "custom", min: 64, dark: true },
        palette({ configuration: "artistic" }, green),
      ),
    ).toEqual([
      ["#111111", "#ffffff"],
      [["#abff7e", "#d1ffba", "#f4ffee"], ["#91e664"], []],
      [],
    ]);
    expect(accessibility({ dark: true }, palette({}, blue))).toEqual([
      ["#111111", "#ffffff"],
      [["#ebf5ff", "#cde5ff", "#aed5ff", "#90c4ff", "#70b4ff", "#4da2ff"], []],
      [],
    ]);
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color/accessibility_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  accessibility(settings, palette)
  • should reject invalid colors
    settings.mode = 'standard'
    • should work with default settings
    • should activate settings.rating
    • should activate settings.large
    settings.mode = 'custom'
    • should activate settings.min
    • should activate settings.max
  • settings.dark active for both modes

running 7 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color/accessibility_test.js
test accessibility(settings, palette) > should reject invalid colors ... ok (22ms)
test accessibility(settings, palette) > settings.mode = 'standard' > should work with default settings ... ok (150ms)
test accessibility(settings, palette) > settings.mode = 'standard' > should activate settings.rating ... ok (497ms)
test accessibility(settings, palette) > settings.mode = 'standard' > should activate settings.large ... ok (195ms)
test accessibility(settings, palette) > settings.mode = 'custom' > should activate settings.min ... ok (190ms)
test accessibility(settings, palette) > settings.mode = 'custom' > should activate settings.max ... ok (209ms)
test accessibility(settings, palette) > settings.dark active for both modes ... ok (194ms)

test result: ok. 7 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (1s)

#+end_src

**** tokens

An emitter that accepts a =palette= and assembles it into a dictionary of color tokens.

+ =tokens(palette) => object=
  - =palette: string[][]=: the generated palette to assemble

***** tokens Examples

***** tokens (Color) Implementation

#+BEGIN_SRC js
export function tokens(palette) {
  return tokenizePalette(palette);
}
#+END_SRC

