Notebook.org
*** Content
:PROPERTIES:
:header-args:js: :tangle "./v2/content.js" :mkdirp yes :comments link
:END:

**** text

A special action for generating font stack and weight tokens.

+ =text(settings, font)=
  - =settings: {}=: text settings
    * =settings.system = "sans": "sans" | "serif" | "monospace"=: system font stack to append
    * =settings.weights = ["regular", "bold"]: Array<"thin" | "extralight" | "light" | "regular" | "medium" |
      "semibold" | "bold" | "extrabold" | "black">=: weights to generate
  - =font: string=: the lead font in the stack (passing ~""~ will only generate a system font stack)

***** text Examples

***** text Implementation

#+BEGIN_SRC js
export function text(settings, font) {
  // Set defaults
  const { system = "sans", weights = ["regular", "bold"] } = settings;

  return textFamily({ system, weights }, font);
}
#+END_SRC

***** text Tests

#+BEGIN_SRC js :tangle "./v2/tests/content/text_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { text } from "../../content.js";

describe("text(settings, font)", () => {
  it("should work with default settings", () => {
    expect(text({}, "")).toEqual({
      family:
        "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
      regular: 400,
      bold: 700,
    });
  });

  describe("settings.system", () => {
    it("system = 'sans'", () =>
      expect(text({ system: "sans" }, "")).toEqual({
        family:
          "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
        regular: 400,
        bold: 700,
      }));
    it("system = 'serif'", () =>
      expect(text({ system: "serif" }, "")).toEqual({
        family:
          "Iowan Old Style, Apple Garamond, Baskerville, Times New Roman, Droid Serif, Times, Source Serif Pro, serif, Apple Color Emoji, Segoe UI Emoji, Segoe UI Symbol",
        regular: 400,
        bold: 700,
      }));
    it("system = 'monospace'", () =>
      expect(text({ system: "monospace" }, "")).toEqual({
        family:
          "Menlo, Consolas, Monaco, Liberation Mono, Lucida Console, monospace",
        regular: 400,
        bold: 700,
      }));
  });

  describe("settings.weights", () => {
    it("should map weight keys to corresponding weight values", () => {
      expect(text({ weights: ["light", "regular", "bold"] }, "")).toEqual({
        family:
          "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
        light: 300,
        regular: 400,
        bold: 700,
      });
      expect(text({ weights: ["thin", "black"] }, "")).toEqual({
        family:
          "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
        thin: 100,
        black: 900,
      });
      expect(
        text(
          {
            weights: [
              "thin",
              "extralight",
              "light",
              "regular",
              "medium",
              "semibold",
              "bold",
              "extrabold",
              "black",
            ],
          },
          ""
        )
      ).toEqual({
        family:
          "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
        thin: 100,
        extralight: 200,
        light: 300,
        regular: 400,
        medium: 500,
        semibold: 600,
        bold: 700,
        extrabold: 800,
        black: 900,
      });
    });
  });

  it("should allow setting a custom lead font", () => {
    expect(text({}, "Mozilla Slab")).toEqual({
      family:
        "Mozilla Slab, -apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
      regular: 400,
      bold: 700,
    });
    expect(text({}, "Work Sans")).toEqual({
      family:
        "Work Sans, -apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
      regular: 400,
      bold: 700,
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/content/text_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  text(settings, font)
  • should work with default settings
    settings.system
    • system = 'sans'
    • system = 'serif'
    • system = 'monospace'
    settings.weights
    • should map weight keys to corresponding weight values
  • should allow setting a custom lead font

running 6 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/content/text_test.js
test text(settings, font) > should work with default settings ... ok (10ms)
test text(settings, font) > settings.system > system = 'sans' ... ok (5ms)
test text(settings, font) > settings.system > system = 'serif' ... ok (6ms)
test text(settings, font) > settings.system > system = 'monospace' ... ok (6ms)
test text(settings, font) > settings.weights > should map weight keys to corresponding weight values ... ok (5ms)
test text(settings, font) > should allow setting a custom lead font ... ok (6ms)

test result: ok. 6 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (118ms)

#+end_src

**** ms

***** ms Examples

***** ms Implementation

#+BEGIN_SRC js
export function ms(settings, base) {
  // Set defaults
  const { ratio = 1.5, values = 6 } = settings;

  return create({ ratio, values }, base);
}
#+END_SRC

***** ms Tests

**** modify

***** modify Examples

***** modify Implementation

#+BEGIN_SRC js
export function modify(calc, ms) {
  return update(calc, ms);
}
#+END_SRC

***** modify Tests

**** tokens

***** tokens Examples

***** tokens (Content) Implementation

#+BEGIN_SRC js
export function tokens(settings, ms) {
  // Set defaults
  const { type = "bidirectional", unit = "rem", inversion = "em" } = settings;

  return assemble({ ...settings, type, unit, inversion }, ms);
}
#+END_SRC

***** tokens (Content) Tests

** Internals
*** Functional
:PROPERTIES:
:header-args:js: :tangle "./v2/fn.js" :mkdirp yes :comments link
:END:

**** Composition Internals

#+BEGIN_SRC js :tangle "./v2/fn.js"
function compose(...fns) {
  return (x) => fns.reduce((g, f) => f(g), x);
}
#+END_SRC

*** Color
:PROPERTIES:
:header-args:js: :tangle "./v2/color.js" :mkdirp yes :comments link
:END:

QuarkSuite accepts and processes most valid CSS color formats defined in [[https://www.w3.org/TR/css-color-4/][CSS Color Module Level 4]]. There are no color objects
to pass around, you just use the colors themselves and get colors back.

**** Conversion

Under the hood, a sequence of tokenization, validation, extraction, parsing, conversion, and serialization (mostly)
guarantees correct color input /and/ output. So wield those colors with confidence.

***** Tokenization

Color format tokenization follows the spec as closely as possible.

Then we have basic =NUMBER_TOKENS=, a =PERCENTAGE_TOKEN=, tokens for the legacy and modern =DELIMITERS=, a
=COMPONENT_TOKEN= combining the first two, and a =HUE_TOKEN=. That's all that's needed to account for every format
QuarkSuite supports.

#+BEGIN_SRC js
const NUMBER_TOKEN = /(?:-?(?!0\d)\d+(?:\.\d+)?)/;
const PERCENTAGE_TOKEN = new RegExp(
  ["(?:", NUMBER_TOKEN.source, "%)"].join(""),
);

const LEGACY_DELIMITER = /(?:[\s,]+)/;
const LEGACY_ALPHA_DELIMITER = new RegExp(
  LEGACY_DELIMITER.source.replace(",", ",/"),
);
const MODERN_DELIMITER = new RegExp(LEGACY_DELIMITER.source.replace(",", ""));
const MODERN_ALPHA_DELIMITER = new RegExp(
  LEGACY_ALPHA_DELIMITER.source.replace(",", ""),
);

const COMPONENT_TOKEN = new RegExp(
  ["(?:", PERCENTAGE_TOKEN.source, "|", NUMBER_TOKEN.source, ")"].join(""),
);
const HUE_TOKEN = new RegExp(
  ["(?:", NUMBER_TOKEN.source, "(?:deg|g?rad|turn)?)"].join(""),
);
#+END_SRC

***** Validation

Defining tokens will make validation of the functional color formats incredibly simple as the tokens can be combined
with the correct format prefix to create a full color string.

****** Named Color Validation

QuarkSuite supports CSS named colors through to CSS Color Module 4 using an object query.

#+BEGIN_SRC js
const NAMED_COLOR_KEYWORDS = {
  aliceblue: "#f0f8ff",
  antiquewhite: "#faebd7",
  aqua: "#00ffff",
  aquamarine: "#7fffd4",
  azure: "#f0ffff",
  beige: "#f5f5dc",
  bisque: "#ffe4c4",
  black: "#000000",
  blanchedalmond: "#ffebcd",
  blue: "#0000ff",
  blueviolet: "#8a2be2",
  brown: "#a52a2a",
  burlywood: "#deb887",
  cadetblue: "#5f9ea0",
  chartreuse: "#7fff00",
  chocolate: "#d2691e",
  coral: "#ff7f50",
  cornflower: "#6495ed",
  cornflowerblue: "#6495ed",
  cornsilk: "#fff8dc",
  crimson: "#dc143c",
  cyan: "#00ffff",
  darkblue: "#00008b",
  darkcyan: "#008b8b",
  darkgoldenrod: "#b8860b",
  darkgray: "#a9a9a9",
  darkgreen: "#006400",
  darkgrey: "#a9a9a9",
  darkkhaki: "#bdb76b",
  darkmagenta: "#8b008b",
  darkolivegreen: "#556b2f",
  darkorange: "#ff8c00",
  darkorchid: "#9932cc",
  darkred: "#8b0000",
  darksalmon: "#e9967a",
  darkseagreen: "#8fbc8f",
  darkslateblue: "#483d8b",
  darkslategray: "#2f4f4f",
  darkslategrey: "#2f4f4f",
  darkturquoise: "#00ced1",
  darkviolet: "#9400d3",
  deeppink: "#ff1493",
  deepskyblue: "#00bfff",
  dimgray: "#696969",
  dimgrey: "#696969",
  dodgerblue: "#1e90ff",
  firebrick: "#b22222",
  floralwhite: "#fffaf0",
  forestgreen: "#228b22",
  fuchsia: "#ff00ff",
  gainsboro: "#dcdcdc",
  ghostwhite: "#f8f8ff",
  gold: "#ffd700",
  goldenrod: "#daa520",
  gray: "#808080",
  green: "#008000",
  greenyellow: "#adff2f",
  grey: "#808080",
  honeydew: "#f0fff0",
  hotpink: "#ff69b4",
  indianred: "#cd5c5c",
  indigo: "#4b0082",
  ivory: "#fffff0",
  khaki: "#f0e68c",
  laserlemon: "#ffff54",
  lavender: "#e6e6fa",
  lavenderblush: "#fff0f5",
  lawngreen: "#7cfc00",
  lemonchiffon: "#fffacd",
  lightblue: "#add8e6",
  lightcoral: "#f08080",
  lightcyan: "#e0ffff",
  lightgoldenrod: "#fafad2",
  lightgoldenrodyellow: "#fafad2",
  lightgray: "#d3d3d3",
  lightgreen: "#90ee90",
  lightgrey: "#d3d3d3",
  lightpink: "#ffb6c1",
  lightsalmon: "#ffa07a",
  lightseagreen: "#20b2aa",
  lightskyblue: "#87cefa",
  lightslategray: "#778899",
  lightslategrey: "#778899",
  lightsteelblue: "#b0c4de",
  lightyellow: "#ffffe0",
  lime: "#00ff00",
  limegreen: "#32cd32",
  linen: "#faf0e6",
  magenta: "#ff00ff",
  maroon: "#800000",
  maroon2: "#7f0000",
  maroon3: "#b03060",
  mediumaquamarine: "#66cdaa",
  mediumblue: "#0000cd",
  mediumorchid: "#ba55d3",
  mediumpurple: "#9370db",
  mediumseagreen: "#3cb371",
  mediumslateblue: "#7b68ee",
  mediumspringgreen: "#00fa9a",
  mediumturquoise: "#48d1cc",
  mediumvioletred: "#c71585",
  midnightblue: "#191970",
  mintcream: "#f5fffa",
  mistyrose: "#ffe4e1",
  moccasin: "#ffe4b5",
  navajowhite: "#ffdead",
  navy: "#000080",
  oldlace: "#fdf5e6",
  olive: "#808000",
  olivedrab: "#6b8e23",
  orange: "#ffa500",
  orangered: "#ff4500",
  orchid: "#da70d6",
  palegoldenrod: "#eee8aa",
  palegreen: "#98fb98",
  paleturquoise: "#afeeee",
  palevioletred: "#db7093",
  papayawhip: "#ffefd5",
  peachpuff: "#ffdab9",
  peru: "#cd853f",
  pink: "#ffc0cb",
  plum: "#dda0dd",
  powderblue: "#b0e0e6",
  purple: "#800080",
  purple2: "#7f007f",
  purple3: "#a020f0",
  rebeccapurple: "#663399",
  red: "#ff0000",
  rosybrown: "#bc8f8f",
  royalblue: "#4169e1",
  saddlebrown: "#8b4513",
  salmon: "#fa8072",
  sandybrown: "#f4a460",
  seagreen: "#2e8b57",
  seashell: "#fff5ee",
  sienna: "#a0522d",
  silver: "#c0c0c0",
  skyblue: "#87ceeb",
  slateblue: "#6a5acd",
  slategray: "#708090",
  slategrey: "#708090",
  snow: "#fffafa",
  springgreen: "#00ff7f",
  steelblue: "#4682b4",
  tan: "#d2b48c",
  teal: "#008080",
  thistle: "#d8bfd8",
  tomato: "#ff6347",
  turquoise: "#40e0d0",
  violet: "#ee82ee",
  wheat: "#f5deb3",
  white: "#ffffff",
  whitesmoke: "#f5f5f5",
  yellow: "#ffff00",
  yellowgreen: "#9acd32",
};

function namedValidator(color) {
  return Boolean(NAMED_COLOR_KEYWORDS[color]);
}
#+END_SRC

****** RGB Hex Validation

This can be done with a regular expression.

#+BEGIN_SRC js
function hexValidator(color) {
  return /^#([\da-f]{3,4}){1,2}$/i.test(color);
}
#+END_SRC

